RT-Thread/rt-thread/bsp/rm48x50/HALCoGen/include/hw_emac.h
/*
 * hw_emac1.h
 */

/* (c) Texas Instruments 2009-2013, All rights reserved. */

#ifndef _HW_EMAC_H_
#define _HW_EMAC_H_

#define EMAC_BASE               (0xFCF78000U)
#define EMAC_CTRL_BASE          (0xFCF78800U)
#define EMAC_CTRL_RAM_BASE      (0xFC520000U)

#define EMAC_TXREVID            (0x0U)
#define EMAC_TXCONTROL            (0x4U)
#define EMAC_TXTEARDOWN            (0x8U)
#define EMAC_RXREVID            (0x10U)
#define EMAC_RXCONTROL            (0x14U)
#define EMAC_RXTEARDOWN            (0x18U)
#define EMAC_TXINTSTATRAW        (0x80U)
#define EMAC_TXINTSTATMASKED    (0x84U)
#define EMAC_TXINTMASKSET        (0x88U)
#define EMAC_TXINTMASKCLEAR        (0x8CU)
#define EMAC_MACINVECTOR        (0x90U)
#define EMAC_MACEOIVECTOR        (0x94U)
#define EMAC_RXINTSTATRAW        (0xA0U)
#define EMAC_RXINTSTATMASKED    (0xA4U)
#define EMAC_RXINTMASKSET        (0xA8U)
#define EMAC_RXINTMASKCLEAR        (0xACU)
#define EMAC_MACINTSTATRAW        (0xB0U)
#define EMAC_MACINTSTATMASKED    (0xB4U)
#define EMAC_MACINTMASKSET        (0xB8U)
#define EMAC_MACINTMASKCLEAR    (0xBCU)
#define EMAC_RXMBPENABLE        (0x100U)
#define EMAC_RXUNICASTSET        (0x104U)
#define EMAC_RXUNICASTCLEAR       (0x108U)
#define EMAC_RXMAXLEN            (0x10CU)
#define EMAC_RXBUFFEROFFSET        (0x110U)
#define EMAC_RXFILTERLOWTHRESH    (0x114U)
#define EMAC_RXFLOWTHRESH(n)    (0x120U + ((n) * 4U))
#define EMAC_RXFREEBUFFER(n)    (0x140U + ((n) * 4U))
#define EMAC_MACCONTROL            (0x160U)
#define EMAC_MACSTATUS            (0x164U)
#define EMAC_EMCONTROL            (0x168U)
#define EMAC_FIFOCONTROL        (0x16CU)
#define EMAC_MACCONFIG            (0x170U)
#define EMAC_SOFTRESET            (0x174U)
#define EMAC_MACSRCADDRLO        (0x1D0U)
#define EMAC_MACSRCADDRHI        (0x1D4U)
#define EMAC_MACHASH1            (0x1D8U)
#define EMAC_MACHASH2            (0x1DCU)
#define EMAC_BOFFTEST            (0x1E0U)
#define EMAC_TPACETEST            (0x1E4U)
#define EMAC_RXPAUSE            (0x1E8U)
#define EMAC_TXPAUSE            (0x1ECU)
#define EMAC_RXGOODFRAMES        (0x200U)
#define EMAC_RXBCASTFRAMES        (0x204U)
#define EMAC_RXMCASTFRAMES        (0x208U)
#define EMAC_RXPAUSEFRAMES        (0x20CU)
#define EMAC_RXCRCERRORS        (0x210U)
#define EMAC_RXALIGNCODEERRORS    (0x214U)
#define EMAC_RXOVERSIZED        (0x218U)
#define EMAC_RXJABBER            (0x21CU)
#define EMAC_RXUNDERSIZED        (0x220U)
#define EMAC_RXFRAGMENTS        (0x224U)
#define EMAC_RXFILTERED            (0x228U)
#define EMAC_RXQOSFILTERED        (0x22CU)
#define EMAC_RXOCTETS            (0x230U)
#define EMAC_TXGOODFRAMES        (0x234U)
#define EMAC_TXBCASTFRAMES        (0x238U)
#define EMAC_TXMCASTFRAMES        (0x23CU)
#define EMAC_TXPAUSEFRAMES        (0x240U)
#define EMAC_TXDEFERRED            (0x244U)
#define EMAC_TXCOLLISION        (0x248U)
#define EMAC_TXSINGLECOLL        (0x24CU)
#define EMAC_TXMULTICOLL        (0x250U)
#define EMAC_TXEXCESSIVECOLL    (0x254U)
#define EMAC_TXLATECOLL            (0x258U)
#define EMAC_TXUNDERRUN            (0x25CU)
#define EMAC_TXCARRIERSENSE       (0x260U)
#define EMAC_TXOCTETS            (0x264U)
#define EMAC_FRAME64            (0x268U)
#define EMAC_FRAME65T127        (0x26CU)
#define EMAC_FRAME128T255        (0x270U)
#define EMAC_FRAME256T511        (0x274U)
#define EMAC_FRAME512T1023        (0x278U)
#define EMAC_FRAME1024TUP        (0x27CU)
#define EMAC_NETOCTETS            (0x208U)
#define EMAC_RXSOFOVERRUNS        (0x284U)
#define EMAC_RXMOFOVERRUNS        (0x288U)
#define EMAC_RXDMAOVERRUNS        (0x28CU)
#define EMAC_MACADDRLO          (0x500U)
#define EMAC_MACADDRHI          (0x504U)
#define EMAC_MACINDEX           (0x508U)
#define EMAC_TXHDP(n)            (0x600U + ((n) * 4U))
#define EMAC_RXHDP(n)            (0x620U + ((n) * 4U))
#define EMAC_TXCP(n)            (0x640U + ((n) * 4U))
#define EMAC_RXCP(n)            (0x660U + ((n) * 4U))

/**************************************************************************\
* Field Definition Macros
\**************************************************************************/

/* TXREVID */

#define EMAC_TXREVID_TXREV      (0xFFFFFFFFU)
#define EMAC_TXREVID_TXREV_SHIFT     (0x00000000U)


/* TXCONTROL */


#define EMAC_TXCONTROL_TXEN     (0x00000001U)
#define EMAC_TXCONTROL_TXEN_SHIFT    (0x00000000U)


/* TXTEARDOWN */

#define EMAC_TXTEARDOWN_TXTDNCH (0x00000007U)
#define EMAC_TXTEARDOWN_TXTDNCH_SHIFT (0x00000000U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA0 (0x00000000U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA1 (0x00000001U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA2 (0x00000002U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA3 (0x00000003U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA4 (0x00000004U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA5 (0x00000005U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA6 (0x00000006U)
#define EMAC_TXTEARDOWN_TXTDNCH_CHA7 (0x00000007U)


/* RXREVID */

#define EMAC_RXREVID_RXREV      (0xFFFFFFFFU)
#define EMAC_RXREVID_RXREV_SHIFT     (0x00000000U)


/* RXCONTROL */


#define EMAC_RXCONTROL_RXEN     (0x00000001U)
#define EMAC_RXCONTROL_RXEN_SHIFT    (0x00000000U)

/* RXTEARDOWN */



#define EMAC_RXTEARDOWN_RXTDNCH (0x00000007U)
#define EMAC_RXTEARDOWN_RXTDNCH_SHIFT (0x00000000U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA0 (0x00000000U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA1 (0x00000001U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA2 (0x00000002U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA3 (0x00000003U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA4 (0x00000004U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA5 (0x00000005U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA6 (0x00000006U)
#define EMAC_RXTEARDOWN_RXTDNCH_CHA7 (0x00000007U)


/* TXINTSTATRAW */


#define EMAC_TXINTSTATRAW_TX7PEND (0x00000080U)
#define EMAC_TXINTSTATRAW_TX7PEND_SHIFT (0x00000007U)

#define EMAC_TXINTSTATRAW_TX6PEND (0x00000040U)
#define EMAC_TXINTSTATRAW_TX6PEND_SHIFT (0x00000006U)

#define EMAC_TXINTSTATRAW_TX5PEND (0x00000020U)
#define EMAC_TXINTSTATRAW_TX5PEND_SHIFT (0x00000005U)

#define EMAC_TXINTSTATRAW_TX4PEND (0x00000010U)
#define EMAC_TXINTSTATRAW_TX4PEND_SHIFT (0x00000004U)

