RT-Thread/rt-thread/bsp/rm48x50/HALCoGen/include/hw_emac.h
#define EMAC_TXINTSTATRAW_TX3PEND (0x00000008U)
#define EMAC_TXINTSTATRAW_TX3PEND_SHIFT (0x00000003U)

#define EMAC_TXINTSTATRAW_TX2PEND (0x00000004U)
#define EMAC_TXINTSTATRAW_TX2PEND_SHIFT (0x00000002U)

#define EMAC_TXINTSTATRAW_TX1PEND (0x00000002U)
#define EMAC_TXINTSTATRAW_TX1PEND_SHIFT (0x00000001U)

#define EMAC_TXINTSTATRAW_TX0PEND (0x00000001U)
#define EMAC_TXINTSTATRAW_TX0PEND_SHIFT (0x00000000U)


/* TXINTSTATMASKED */


#define EMAC_TXINTSTATMASKED_TX7PEND (0x00000080U)
#define EMAC_TXINTSTATMASKED_TX7PEND_SHIFT (0x00000007U)

#define EMAC_TXINTSTATMASKED_TX6PEND (0x00000040U)
#define EMAC_TXINTSTATMASKED_TX6PEND_SHIFT (0x00000006U)

#define EMAC_TXINTSTATMASKED_TX5PEND (0x00000020U)
#define EMAC_TXINTSTATMASKED_TX5PEND_SHIFT (0x00000005U)

#define EMAC_TXINTSTATMASKED_TX4PEND (0x00000010U)
#define EMAC_TXINTSTATMASKED_TX4PEND_SHIFT (0x00000004U)

#define EMAC_TXINTSTATMASKED_TX3PEND (0x00000008U)
#define EMAC_TXINTSTATMASKED_TX3PEND_SHIFT (0x00000003U)

#define EMAC_TXINTSTATMASKED_TX2PEND (0x00000004U)
#define EMAC_TXINTSTATMASKED_TX2PEND_SHIFT (0x00000002U)

#define EMAC_TXINTSTATMASKED_TX1PEND (0x00000002U)
#define EMAC_TXINTSTATMASKED_TX1PEND_SHIFT (0x00000001U)

#define EMAC_TXINTSTATMASKED_TX0PEND (0x00000001U)
#define EMAC_TXINTSTATMASKED_TX0PEND_SHIFT (0x00000000U)


/* TXINTMASKSET */


#define EMAC_TXINTMASKSET_TX7MASK (0x00000080U)
#define EMAC_TXINTMASKSET_TX7MASK_SHIFT (0x00000007U)

#define EMAC_TXINTMASKSET_TX6MASK (0x00000040U)
#define EMAC_TXINTMASKSET_TX6MASK_SHIFT (0x00000006U)

#define EMAC_TXINTMASKSET_TX5MASK (0x00000020U)
#define EMAC_TXINTMASKSET_TX5MASK_SHIFT (0x00000005U)

#define EMAC_TXINTMASKSET_TX4MASK (0x00000010U)
#define EMAC_TXINTMASKSET_TX4MASK_SHIFT (0x00000004U)

#define EMAC_TXINTMASKSET_TX3MASK (0x00000008U)
#define EMAC_TXINTMASKSET_TX3MASK_SHIFT (0x00000003U)

#define EMAC_TXINTMASKSET_TX2MASK (0x00000004U)
#define EMAC_TXINTMASKSET_TX2MASK_SHIFT (0x00000002U)

#define EMAC_TXINTMASKSET_TX1MASK (0x00000002U)
#define EMAC_TXINTMASKSET_TX1MASK_SHIFT (0x00000001U)

#define EMAC_TXINTMASKSET_TX0MASK (0x00000001U)
#define EMAC_TXINTMASKSET_TX0MASK_SHIFT (0x00000000U)


/* TXINTMASKCLEAR */


#define EMAC_TXINTMASKCLEAR_TX7MASK (0x00000080U)
#define EMAC_TXINTMASKCLEAR_TX7MASK_SHIFT (0x00000007U)

#define EMAC_TXINTMASKCLEAR_TX6MASK (0x00000040U)
#define EMAC_TXINTMASKCLEAR_TX6MASK_SHIFT (0x00000006U)

#define EMAC_TXINTMASKCLEAR_TX5MASK (0x00000020U)
#define EMAC_TXINTMASKCLEAR_TX5MASK_SHIFT (0x00000005U)

#define EMAC_TXINTMASKCLEAR_TX4MASK (0x00000010U)
#define EMAC_TXINTMASKCLEAR_TX4MASK_SHIFT (0x00000004U)

#define EMAC_TXINTMASKCLEAR_TX3MASK (0x00000008U)
#define EMAC_TXINTMASKCLEAR_TX3MASK_SHIFT (0x00000003U)

#define EMAC_TXINTMASKCLEAR_TX2MASK (0x00000004U)
#define EMAC_TXINTMASKCLEAR_TX2MASK_SHIFT (0x00000002U)

#define EMAC_TXINTMASKCLEAR_TX1MASK (0x00000002U)
#define EMAC_TXINTMASKCLEAR_TX1MASK_SHIFT (0x00000001U)

#define EMAC_TXINTMASKCLEAR_TX0MASK (0x00000001U)
#define EMAC_TXINTMASKCLEAR_TX0MASK_SHIFT (0x00000000U)


/* MACINVECTOR */


#define EMAC_MACINVECTOR_STATPEND (0x08000000U)
#define EMAC_MACINVECTOR_STATPEND_SHIFT (0x0000001BU)

#define EMAC_MACINVECTOR_HOSTPEND (0x04000000U)
#define EMAC_MACINVECTOR_HOSTPEND_SHIFT (0x0000001AU)

#define EMAC_MACINVECTOR_LINKINT0 (0x02000000U)
#define EMAC_MACINVECTOR_LINKINT0_SHIFT (0x00000019U)

#define EMAC_MACINVECTOR_USERINT0 (0x01000000U)
#define EMAC_MACINVECTOR_USERINT0_SHIFT (0x00000018U)

#define EMAC_MACINVECTOR_TXPEND (0x00FF0000U)
#define EMAC_MACINVECTOR_TXPEND_SHIFT (0x00000010U)

#define EMAC_MACINVECTOR_RXTHRESHPEND (0x0000FF00U)
#define EMAC_MACINVECTOR_RXTHRESHPEND_SHIFT (0x00000008U)

#define EMAC_MACINVECTOR_RXPEND (0x000000FFU)
#define EMAC_MACINVECTOR_RXPEND_SHIFT (0x00000000U)


/* MACEOIVECTOR */


#define EMAC_MACEOIVECTOR_INTVECT (0x0000001FU)
#define EMAC_MACEOIVECTOR_INTVECT_SHIFT (0x00000000U)
/*----INTVECT Tokens----*/
#define EMAC_MACEOIVECTOR_INTVECT_C0RXTHRESH (0x00000000U)
#define EMAC_MACEOIVECTOR_INTVECT_C0RX (0x00000001U)
#define EMAC_MACEOIVECTOR_INTVECT_C0TX (0x00000002U)
#define EMAC_MACEOIVECTOR_INTVECT_C0MISC (0x00000003U)
#define EMAC_MACEOIVECTOR_INTVECT_C1RXTHRESH (0x00000004U)
#define EMAC_MACEOIVECTOR_INTVECT_C1RX (0x00000005U)
#define EMAC_MACEOIVECTOR_INTVECT_C1TX (0x00000006U)
#define EMAC_MACEOIVECTOR_INTVECT_C1MISC (0x00000007U)


/* RXINTSTATRAW */


#define EMAC_RXINTSTATRAW_RX7THRESHPEND (0x00008000U)
#define EMAC_RXINTSTATRAW_RX7THRESHPEND_SHIFT (0x0000000FU)

#define EMAC_RXINTSTATRAW_RX6THRESHPEND (0x00004000U)
#define EMAC_RXINTSTATRAW_RX6THRESHPEND_SHIFT (0x0000000EU)

#define EMAC_RXINTSTATRAW_RX5THRESHPEND (0x00002000U)
#define EMAC_RXINTSTATRAW_RX5THRESHPEND_SHIFT (0x0000000DU)

#define EMAC_RXINTSTATRAW_RX4THRESHPEND (0x00001000U)
#define EMAC_RXINTSTATRAW_RX4THRESHPEND_SHIFT (0x0000000CU)

#define EMAC_RXINTSTATRAW_RX3THRESHPEND (0x00000800U)
#define EMAC_RXINTSTATRAW_RX3THRESHPEND_SHIFT (0x0000000BU)

#define EMAC_RXINTSTATRAW_RX2THRESHPEND (0x00000400U)
#define EMAC_RXINTSTATRAW_RX2THRESHPEND_SHIFT (0x0000000AU)

#define EMAC_RXINTSTATRAW_RX1THRESHPEND (0x00000200U)
#define EMAC_RXINTSTATRAW_RX1THRESHPEND_SHIFT (0x00000009U)

#define EMAC_RXINTSTATRAW_RX0THRESHPEND (0x00000100U)
#define EMAC_RXINTSTATRAW_RX0THRESHPEND_SHIFT (0x00000008U)

#define EMAC_RXINTSTATRAW_RX7PEND (0x00000080U)
#define EMAC_RXINTSTATRAW_RX7PEND_SHIFT (0x00000007U)

#define EMAC_RXINTSTATRAW_RX6PEND (0x00000040U)
#define EMAC_RXINTSTATRAW_RX6PEND_SHIFT (0x00000006U)

#define EMAC_RXINTSTATRAW_RX5PEND (0x00000020U)
#define EMAC_RXINTSTATRAW_RX5PEND_SHIFT (0x00000005U)

#define EMAC_RXINTSTATRAW_RX4PEND (0x00000010U)
#define EMAC_RXINTSTATRAW_RX4PEND_SHIFT (0x00000004U)

#define EMAC_RXINTSTATRAW_RX3PEND (0x00000008U)
#define EMAC_RXINTSTATRAW_RX3PEND_SHIFT (0x00000003U)

#define EMAC_RXINTSTATRAW_RX2PEND (0x00000004U)
#define EMAC_RXINTSTATRAW_RX2PEND_SHIFT (0x00000002U)

#define EMAC_RXINTSTATRAW_RX1PEND (0x00000002U)
#define EMAC_RXINTSTATRAW_RX1PEND_SHIFT (0x00000001U)

