RT-Thread/rt-thread/bsp/rm48x50/HALCoGen/include/hw_emac.h
#define EMAC_RXINTSTATRAW_RX0PEND (0x00000001U)
#define EMAC_RXINTSTATRAW_RX0PEND_SHIFT (0x00000000U)


/* RXINTSTATMASKED */


#define EMAC_RXINTSTATMASKED_RX7THRESHPEND (0x00008000U)
#define EMAC_RXINTSTATMASKED_RX7THRESHPEND_SHIFT (0x0000000FU)

#define EMAC_RXINTSTATMASKED_RX6THRESHPEND (0x00004000U)
#define EMAC_RXINTSTATMASKED_RX6THRESHPEND_SHIFT (0x0000000EU)

#define EMAC_RXINTSTATMASKED_RX5THRESHPEND (0x00002000U)
#define EMAC_RXINTSTATMASKED_RX5THRESHPEND_SHIFT (0x0000000DU)

#define EMAC_RXINTSTATMASKED_RX4THRESHPEND (0x00001000U)
#define EMAC_RXINTSTATMASKED_RX4THRESHPEND_SHIFT (0x0000000CU)

#define EMAC_RXINTSTATMASKED_RX3THRESHPEND (0x00000800U)
#define EMAC_RXINTSTATMASKED_RX3THRESHPEND_SHIFT (0x0000000BU)

#define EMAC_RXINTSTATMASKED_RX2THRESHPEND (0x00000400U)
#define EMAC_RXINTSTATMASKED_RX2THRESHPEND_SHIFT (0x0000000AU)

#define EMAC_RXINTSTATMASKED_RX1THRESHPEND (0x00000200U)
#define EMAC_RXINTSTATMASKED_RX1THRESHPEND_SHIFT (0x00000009U)

#define EMAC_RXINTSTATMASKED_RX0THRESHPEND (0x00000100U)
#define EMAC_RXINTSTATMASKED_RX0THRESHPEND_SHIFT (0x00000008U)

#define EMAC_RXINTSTATMASKED_RX7PEND (0x00000080U)
#define EMAC_RXINTSTATMASKED_RX7PEND_SHIFT (0x00000007U)

#define EMAC_RXINTSTATMASKED_RX6PEND (0x00000040U)
#define EMAC_RXINTSTATMASKED_RX6PEND_SHIFT (0x00000006U)

#define EMAC_RXINTSTATMASKED_RX5PEND (0x00000020U)
#define EMAC_RXINTSTATMASKED_RX5PEND_SHIFT (0x00000005U)

#define EMAC_RXINTSTATMASKED_RX4PEND (0x00000010U)
#define EMAC_RXINTSTATMASKED_RX4PEND_SHIFT (0x00000004U)

#define EMAC_RXINTSTATMASKED_RX3PEND (0x00000008U)
#define EMAC_RXINTSTATMASKED_RX3PEND_SHIFT (0x00000003U)

#define EMAC_RXINTSTATMASKED_RX2PEND (0x00000004U)
#define EMAC_RXINTSTATMASKED_RX2PEND_SHIFT (0x00000002U)

#define EMAC_RXINTSTATMASKED_RX1PEND (0x00000002U)
#define EMAC_RXINTSTATMASKED_RX1PEND_SHIFT (0x00000001U)

#define EMAC_RXINTSTATMASKED_RX0PEND (0x00000001U)
#define EMAC_RXINTSTATMASKED_RX0PEND_SHIFT (0x00000000U)


/* RXINTMASKSET */


#define EMAC_RXINTMASKSET_RX7THRESHMASK (0x00008000U)
#define EMAC_RXINTMASKSET_RX7THRESHMASK_SHIFT (0x0000000FU)

#define EMAC_RXINTMASKSET_RX6THRESHMASK (0x00004000U)
#define EMAC_RXINTMASKSET_RX6THRESHMASK_SHIFT (0x0000000EU)

#define EMAC_RXINTMASKSET_RX5THRESHMASK (0x00002000U)
#define EMAC_RXINTMASKSET_RX5THRESHMASK_SHIFT (0x0000000DU)

#define EMAC_RXINTMASKSET_RX4THRESHMASK (0x00001000U)
#define EMAC_RXINTMASKSET_RX4THRESHMASK_SHIFT (0x0000000CU)

#define EMAC_RXINTMASKSET_RX3THRESHMASK (0x00000800U)
#define EMAC_RXINTMASKSET_RX3THRESHMASK_SHIFT (0x0000000BU)

#define EMAC_RXINTMASKSET_RX2THRESHMASK (0x00000400U)
#define EMAC_RXINTMASKSET_RX2THRESHMASK_SHIFT (0x0000000AU)

#define EMAC_RXINTMASKSET_RX1THRESHMASK (0x00000200U)
#define EMAC_RXINTMASKSET_RX1THRESHMASK_SHIFT (0x00000009U)

#define EMAC_RXINTMASKSET_RX0THRESHMASK (0x00000100U)
#define EMAC_RXINTMASKSET_RX0THRESHMASK_SHIFT (0x00000008U)

#define EMAC_RXINTMASKSET_RX7MASK (0x00000080U)
#define EMAC_RXINTMASKSET_RX7MASK_SHIFT (0x00000007U)

#define EMAC_RXINTMASKSET_RX6MASK (0x00000040U)
#define EMAC_RXINTMASKSET_RX6MASK_SHIFT (0x00000006U)

#define EMAC_RXINTMASKSET_RX5MASK (0x00000020U)
#define EMAC_RXINTMASKSET_RX5MASK_SHIFT (0x00000005U)

#define EMAC_RXINTMASKSET_RX4MASK (0x00000010U)
#define EMAC_RXINTMASKSET_RX4MASK_SHIFT (0x00000004U)

#define EMAC_RXINTMASKSET_RX3MASK (0x00000008U)
#define EMAC_RXINTMASKSET_RX3MASK_SHIFT (0x00000003U)

#define EMAC_RXINTMASKSET_RX2MASK (0x00000004U)
#define EMAC_RXINTMASKSET_RX2MASK_SHIFT (0x00000002U)

#define EMAC_RXINTMASKSET_RX1MASK (0x00000002U)
#define EMAC_RXINTMASKSET_RX1MASK_SHIFT (0x00000001U)

#define EMAC_RXINTMASKSET_RX0MASK (0x00000001U)
#define EMAC_RXINTMASKSET_RX0MASK_SHIFT (0x00000000U)


/* RXINTMASKCLEAR */


#define EMAC_RXINTMASKCLEAR_RX7THRESHMASK (0x00008000U)
#define EMAC_RXINTMASKCLEAR_RX7THRESHMASK_SHIFT (0x0000000FU)

#define EMAC_RXINTMASKCLEAR_RX6THRESHMASK (0x00004000U)
#define EMAC_RXINTMASKCLEAR_RX6THRESHMASK_SHIFT (0x0000000EU)

#define EMAC_RXINTMASKCLEAR_RX5THRESHMASK (0x00002000U)
#define EMAC_RXINTMASKCLEAR_RX5THRESHMASK_SHIFT (0x0000000DU)

#define EMAC_RXINTMASKCLEAR_RX4THRESHMASK (0x00001000U)
#define EMAC_RXINTMASKCLEAR_RX4THRESHMASK_SHIFT (0x0000000CU)

#define EMAC_RXINTMASKCLEAR_RX3THRESHMASK (0x00000800U)
#define EMAC_RXINTMASKCLEAR_RX3THRESHMASK_SHIFT (0x0000000BU)

#define EMAC_RXINTMASKCLEAR_RX2THRESHMASK (0x00000400U)
#define EMAC_RXINTMASKCLEAR_RX2THRESHMASK_SHIFT (0x0000000AU)

#define EMAC_RXINTMASKCLEAR_RX1THRESHMASK (0x00000200U)
#define EMAC_RXINTMASKCLEAR_RX1THRESHMASK_SHIFT (0x00000009U)

#define EMAC_RXINTMASKCLEAR_RX0THRESHMASK (0x00000100U)
#define EMAC_RXINTMASKCLEAR_RX0THRESHMASK_SHIFT (0x00000008U)

#define EMAC_RXINTMASKCLEAR_RX7MASK (0x00000080U)
#define EMAC_RXINTMASKCLEAR_RX7MASK_SHIFT (0x00000007U)

#define EMAC_RXINTMASKCLEAR_RX6MASK (0x00000040U)
#define EMAC_RXINTMASKCLEAR_RX6MASK_SHIFT (0x00000006U)

#define EMAC_RXINTMASKCLEAR_RX5MASK (0x00000020U)
#define EMAC_RXINTMASKCLEAR_RX5MASK_SHIFT (0x00000005U)

#define EMAC_RXINTMASKCLEAR_RX4MASK (0x00000010U)
#define EMAC_RXINTMASKCLEAR_RX4MASK_SHIFT (0x00000004U)

#define EMAC_RXINTMASKCLEAR_RX3MASK (0x00000008U)
#define EMAC_RXINTMASKCLEAR_RX3MASK_SHIFT (0x00000003U)

#define EMAC_RXINTMASKCLEAR_RX2MASK (0x00000004U)
#define EMAC_RXINTMASKCLEAR_RX2MASK_SHIFT (0x00000002U)

#define EMAC_RXINTMASKCLEAR_RX1MASK (0x00000002U)
#define EMAC_RXINTMASKCLEAR_RX1MASK_SHIFT (0x00000001U)

#define EMAC_RXINTMASKCLEAR_RX0MASK (0x00000001U)
#define EMAC_RXINTMASKCLEAR_RX0MASK_SHIFT (0x00000000U)


/* MACINTSTATRAW */


#define EMAC_MACINTSTATRAW_HOSTPEND (0x00000002U)
#define EMAC_MACINTSTATRAW_HOSTPEND_SHIFT (0x00000001U)

#define EMAC_MACINTSTATRAW_STATPEND (0x00000001U)
#define EMAC_MACINTSTATRAW_STATPEND_SHIFT (0x00000000U)


/* MACINTSTATMASKED */


#define EMAC_MACINTSTATMASKED_HOSTPEND (0x00000002U)
#define EMAC_MACINTSTATMASKED_HOSTPEND_SHIFT (0x00000001U)

#define EMAC_MACINTSTATMASKED_STATPEND (0x00000001U)
#define EMAC_MACINTSTATMASKED_STATPEND_SHIFT (0x00000000U)


/* MACINTMASKSET */


#define EMAC_MACINTMASKSET_HOSTMASK (0x00000002U)
#define EMAC_MACINTMASKSET_HOSTMASK_SHIFT (0x00000001U)

#define EMAC_MACINTMASKSET_STATMASK (0x00000001U)
#define EMAC_MACINTMASKSET_STATMASK_SHIFT (0x00000000U)


/* MACINTMASKCLEAR */


#define EMAC_MACINTMASKCLEAR_HOSTMASK (0x00000002U)
#define EMAC_MACINTMASKCLEAR_HOSTMASK_SHIFT (0x00000001U)

#define EMAC_MACINTMASKCLEAR_STATMASK (0x00000001U)
#define EMAC_MACINTMASKCLEAR_STATMASK_SHIFT (0x00000000U)


/* RXMBPENABLE */


#define EMAC_RXMBPENABLE_RXPASSCRC (0x40000000U)
#define EMAC_RXMBPENABLE_RXPASSCRC_SHIFT (0x0000001EU)
#define EMAC_RXMBPENABLE_RXQOSEN (0x20000000U)
#define EMAC_RXMBPENABLE_RXQOSEN_SHIFT (0x0000001DU)
#define EMAC_RXMBPENABLE_RXNOCHAIN (0x10000000U)
#define EMAC_RXMBPENABLE_RXNOCHAIN_SHIFT (0x0000001CU)
#define EMAC_RXMBPENABLE_RXCMFEN (0x01000000U)
#define EMAC_RXMBPENABLE_RXCMFEN_SHIFT (0x00000018U)
#define EMAC_RXMBPENABLE_RXCSFEN (0x00800000U)
#define EMAC_RXMBPENABLE_RXCSFEN_SHIFT (0x00000017U)
#define EMAC_RXMBPENABLE_RXCEFEN (0x00400000U)
#define EMAC_RXMBPENABLE_RXCEFEN_SHIFT (0x00000016U)
#define EMAC_RXMBPENABLE_RXCAFEN (0x00200000U)
#define EMAC_RXMBPENABLE_RXCAFEN_SHIFT (0x00000015U)
/*----RXCAFEN Tokens----*/
#define EMAC_RXMBPENABLE_RXPROMCH (0x00070000U)
#define EMAC_RXMBPENABLE_RXPROMCH_SHIFT (0x00000010U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA7 (0x00000007U)


#define EMAC_RXMBPENABLE_RXBROADEN (0x00002000U)
#define EMAC_RXMBPENABLE_RXBROADEN_SHIFT (0x0000000DU)
#define EMAC_RXMBPENABLE_RXBROADCH (0x00000700U)
#define EMAC_RXMBPENABLE_RXBROADCH_SHIFT (0x00000008U)
/*----RXBROADCH Tokens----*/
#define EMAC_RXMBPENABLE_RXBROADCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA7 (0x00000007U)


#define EMAC_RXMBPENABLE_RXMULTEN (0x00000020U)
#define EMAC_RXMBPENABLE_RXMULTEN_SHIFT (0x00000005U)
#define EMAC_RXMBPENABLE_RXMULTCH (0x00000007U)
#define EMAC_RXMBPENABLE_RXMULTCH_SHIFT (0x00000000U)
/*----RXMULTCH Tokens----*/
#define EMAC_RXMBPENABLE_RXMULTCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA7 (0x00000007U)


/* RXUNICASTSET */


#define EMAC_RXUNICASTSET_RXCH7EN (0x00000080U)
#define EMAC_RXUNICASTSET_RXCH7EN_SHIFT (0x00000007U)
#define EMAC_RXUNICASTSET_RXCH6EN (0x00000040U)
#define EMAC_RXUNICASTSET_RXCH6EN_SHIFT (0x00000006U)
#define EMAC_RXUNICASTSET_RXCH5EN (0x00000020U)
#define EMAC_RXUNICASTSET_RXCH5EN_SHIFT (0x00000005U)
#define EMAC_RXUNICASTSET_RXCH4EN (0x00000010U)
#define EMAC_RXUNICASTSET_RXCH4EN_SHIFT (0x00000004U)
#define EMAC_RXUNICASTSET_RXCH3EN (0x00000008U)
#define EMAC_RXUNICASTSET_RXCH3EN_SHIFT (0x00000003U)
#define EMAC_RXUNICASTSET_RXCH2EN (0x00000004U)
#define EMAC_RXUNICASTSET_RXCH2EN_SHIFT (0x00000002U)
#define EMAC_RXUNICASTSET_RXCH1EN (0x00000002U)
#define EMAC_RXUNICASTSET_RXCH1EN_SHIFT (0x00000001U)
#define EMAC_RXUNICASTSET_RXCH0EN (0x00000001U)
#define EMAC_RXUNICASTSET_RXCH0EN_SHIFT (0x00000000U)

/* RXUNICASTCLEAR */


#define EMAC_RXUNICASTCLEAR_RXCH7EN (0x00000080U)
#define EMAC_RXUNICASTCLEAR_RXCH7EN_SHIFT (0x00000007U)
#define EMAC_RXUNICASTCLEAR_RXCH6EN (0x00000040U)
#define EMAC_RXUNICASTCLEAR_RXCH6EN_SHIFT (0x00000006U)
#define EMAC_RXUNICASTCLEAR_RXCH5EN (0x00000020U)
#define EMAC_RXUNICASTCLEAR_RXCH5EN_SHIFT (0x00000005U)
#define EMAC_RXUNICASTCLEAR_RXCH4EN (0x00000010U)
#define EMAC_RXUNICASTCLEAR_RXCH4EN_SHIFT (0x00000004U)
#define EMAC_RXUNICASTCLEAR_RXCH3EN (0x00000008U)
#define EMAC_RXUNICASTCLEAR_RXCH3EN_SHIFT (0x00000003U)
#define EMAC_RXUNICASTCLEAR_RXCH2EN (0x00000004U)
#define EMAC_RXUNICASTCLEAR_RXCH2EN_SHIFT (0x00000002U)
#define EMAC_RXUNICASTCLEAR_RXCH1EN (0x00000002U)
#define EMAC_RXUNICASTCLEAR_RXCH1EN_SHIFT (0x00000001U)
#define EMAC_RXUNICASTCLEAR_RXCH0EN (0x00000001U)
#define EMAC_RXUNICASTCLEAR_RXCH0EN_SHIFT (0x00000000U)

/* RXMAXLEN */


#define EMAC_RXMAXLEN_RXMAXLEN  (0x0000FFFFU)
#define EMAC_RXMAXLEN_RXMAXLEN_SHIFT (0x00000000U)


/* RXBUFFEROFFSET */


#define EMAC_RXBUFFEROFFSET_RXBUFFEROFFSET (0x0000FFFFU)
#define EMAC_RXBUFFEROFFSET_RXBUFFEROFFSET_SHIFT (0x00000000U)


