RT-Thread/rt-thread/bsp/rm48x50/HALCoGen/include/hw_emac.h
/* RXFILTERLOWTHRESH */


#define EMAC_RXFILTERLOWTHRESH_RXFILTERTHRESH (0x000000FFU)
#define EMAC_RXFILTERLOWTHRESH_RXFILTERTHRESH_SHIFT (0x00000000U)


/* RX0FLOWTHRESH */


#define EMAC_RX0FLOWTHRESH_RX0FLOWTHRESH (0x000000FFU)
#define EMAC_RX0FLOWTHRESH_RX0FLOWTHRESH_SHIFT (0x00000000U)


/* RX1FLOWTHRESH */


#define EMAC_RX1FLOWTHRESH_RX1FLOWTHRESH (0x000000FFU)
#define EMAC_RX1FLOWTHRESH_RX1FLOWTHRESH_SHIFT (0x00000000U)


/* RX2FLOWTHRESH */


#define EMAC_RX2FLOWTHRESH_RX2FLOWTHRESH (0x000000FFU)
#define EMAC_RX2FLOWTHRESH_RX2FLOWTHRESH_SHIFT (0x00000000U)


/* RX3FLOWTHRESH */


#define EMAC_RX3FLOWTHRESH_RX3FLOWTHRESH (0x000000FFU)
#define EMAC_RX3FLOWTHRESH_RX3FLOWTHRESH_SHIFT (0x00000000U)


/* RX4FLOWTHRESH */


#define EMAC_RX4FLOWTHRESH_RX4FLOWTHRESH (0x000000FFU)
#define EMAC_RX4FLOWTHRESH_RX4FLOWTHRESH_SHIFT (0x00000000U)


/* RX5FLOWTHRESH */


#define EMAC_RX5FLOWTHRESH_RX5FLOWTHRESH (0x000000FFU)
#define EMAC_RX5FLOWTHRESH_RX5FLOWTHRESH_SHIFT (0x00000000U)


/* RX6FLOWTHRESH */


#define EMAC_RX6FLOWTHRESH_RX6FLOWTHRESH (0x000000FFU)
#define EMAC_RX6FLOWTHRESH_RX6FLOWTHRESH_SHIFT (0x00000000U)


/* RX7FLOWTHRESH */


#define EMAC_RX7FLOWTHRESH_RX7FLOWTHRESH (0x000000FFU)
#define EMAC_RX7FLOWTHRESH_RX7FLOWTHRESH_SHIFT (0x00000000U)


/* RX0FREEBUFFER */


#define EMAC_RX0FREEBUFFER_RX0FREEBUF (0x0000FFFFU)
#define EMAC_RX0FREEBUFFER_RX0FREEBUF_SHIFT (0x00000000U)


/* RX1FREEBUFFER */


#define EMAC_RX1FREEBUFFER_RX1FREEBUF (0x0000FFFFU)
#define EMAC_RX1FREEBUFFER_RX1FREEBUF_SHIFT (0x00000000U)


/* RX2FREEBUFFER */


#define EMAC_RX2FREEBUFFER_RX2FREEBUF (0x0000FFFFU)
#define EMAC_RX2FREEBUFFER_RX2FREEBUF_SHIFT (0x00000000U)


/* RX3FREEBUFFER */


#define EMAC_RX3FREEBUFFER_RX3FREEBUF (0x0000FFFFU)
#define EMAC_RX3FREEBUFFER_RX3FREEBUF_SHIFT (0x00000000U)


/* RX4FREEBUFFER */


#define EMAC_RX4FREEBUFFER_RX4FREEBUF (0x0000FFFFU)
#define EMAC_RX4FREEBUFFER_RX4FREEBUF_SHIFT (0x00000000U)


/* RX5FREEBUFFER */


#define EMAC_RX5FREEBUFFER_RX5FREEBUF (0x0000FFFFU)
#define EMAC_RX5FREEBUFFER_RX5FREEBUF_SHIFT (0x00000000U)


/* RX6FREEBUFFER */


#define EMAC_RX6FREEBUFFER_RX6FREEBUF (0x0000FFFFU)
#define EMAC_RX6FREEBUFFER_RX6FREEBUF_SHIFT (0x00000000U)


/* RX7FREEBUFFER */


#define EMAC_RX7FREEBUFFER_RX7FREEBUF (0x0000FFFFU)
#define EMAC_RX7FREEBUFFER_RX7FREEBUF_SHIFT (0x00000000U)


/* MACCONTROL */





#define EMAC_MACCONTROL_RMIISPEED (0x00008000U)
#define EMAC_MACCONTROL_RMIISPEED_SHIFT (0x0000000FU)
#define EMAC_MACCONTROL_RXOFFLENBLOCK (0x00004000U)
#define EMAC_MACCONTROL_RXOFFLENBLOCK_SHIFT (0x0000000EU)
#define EMAC_MACCONTROL_RXOWNERSHIP (0x00002000U)
#define EMAC_MACCONTROL_RXOWNERSHIP_SHIFT (0x0000000DU)
#define EMAC_MACCONTROL_CMDIDLE (0x00000800U)
#define EMAC_MACCONTROL_CMDIDLE_SHIFT (0x0000000BU)
#define EMAC_MACCONTROL_TXSHORTGAPEN (0x00000400U)
#define EMAC_MACCONTROL_TXSHORTGAPEN_SHIFT (0x0000000AU)
#define EMAC_MACCONTROL_TXPTYPE (0x00000200U)
#define EMAC_MACCONTROL_TXPTYPE_SHIFT (0x00000009U)
#define EMAC_MACCONTROL_TXPACE  (0x00000040U)
#define EMAC_MACCONTROL_TXPACE_SHIFT (0x00000006U)
#define EMAC_MACCONTROL_GMIIEN  (0x00000020U)
#define EMAC_MACCONTROL_GMIIEN_SHIFT (0x00000005U)
#define EMAC_MACCONTROL_TXFLOWEN (0x00000010U)
#define EMAC_MACCONTROL_TXFLOWEN_SHIFT (0x00000004U)
#define EMAC_MACCONTROL_RXBUFFERFLOWEN (0x00000008U)
#define EMAC_MACCONTROL_RXBUFFERFLOWEN_SHIFT (0x00000003U)
#define EMAC_MACCONTROL_LOOPBACK (0x00000002U)
#define EMAC_MACCONTROL_LOOPBACK_SHIFT (0x00000001U)
#define EMAC_MACCONTROL_FULLDUPLEX (0x00000001U)
#define EMAC_MACCONTROL_FULLDUPLEX_SHIFT (0x00000000U)


/* MACSTATUS */

#define EMAC_MACSTATUS_IDLE     (0x80000000U)
#define EMAC_MACSTATUS_IDLE_SHIFT    (0x0000001FU)
#define EMAC_MACSTATUS_TXERRCODE (0x00F00000U)
#define EMAC_MACSTATUS_TXERRCODE_SHIFT (0x00000014U)
/*----TXERRCODE Tokens----*/
#define EMAC_MACSTATUS_TXERRCODE_NOERROR (0x00000000U)
#define EMAC_MACSTATUS_TXERRCODE_SOPERROR (0x00000001U)
#define EMAC_MACSTATUS_TXERRCODE_OWNERSHIP (0x00000002U)
#define EMAC_MACSTATUS_TXERRCODE_NOEOP (0x00000003U)
#define EMAC_MACSTATUS_TXERRCODE_NULLPTR (0x00000004U)
#define EMAC_MACSTATUS_TXERRCODE_NULLEN (0x00000005U)
#define EMAC_MACSTATUS_TXERRCODE_LENERROR (0x00000006U)


#define EMAC_MACSTATUS_TXERRCH  (0x00070000U)
#define EMAC_MACSTATUS_TXERRCH_SHIFT (0x00000010U)
/*----TXERRCH Tokens----*/
#define EMAC_MACSTATUS_TXERRCH_CHA0  (0x00000000U)
#define EMAC_MACSTATUS_TXERRCH_CHA1  (0x00000001U)
#define EMAC_MACSTATUS_TXERRCH_CHA2  (0x00000002U)
#define EMAC_MACSTATUS_TXERRCH_CHA3  (0x00000003U)
#define EMAC_MACSTATUS_TXERRCH_CHA4  (0x00000004U)
#define EMAC_MACSTATUS_TXERRCH_CHA5  (0x00000005U)
#define EMAC_MACSTATUS_TXERRCH_CHA6  (0x00000006U)
#define EMAC_MACSTATUS_TXERRCH_CHA7  (0x00000007U)

#define EMAC_MACSTATUS_RXERRCODE (0x0000F000U)
#define EMAC_MACSTATUS_RXERRCODE_SHIFT (0x0000000CU)
/*----RXERRCODE Tokens----*/
#define EMAC_MACSTATUS_RXERRCODE_NOERROR (0x00000000U)
#define EMAC_MACSTATUS_RXERRCODE_OWNERSHIP (0x00000002U)
#define EMAC_MACSTATUS_RXERRCODE_NULLPTR (0x00000004U)


#define EMAC_MACSTATUS_RXERRCH  (0x00000700U)
#define EMAC_MACSTATUS_RXERRCH_SHIFT (0x00000008U)
/*----RXERRCH Tokens----*/
#define EMAC_MACSTATUS_RXERRCH_CHA0  (0x00000000U)
#define EMAC_MACSTATUS_RXERRCH_CHA1  (0x00000001U)
#define EMAC_MACSTATUS_RXERRCH_CHA2  (0x00000002U)
#define EMAC_MACSTATUS_RXERRCH_CHA3  (0x00000003U)
#define EMAC_MACSTATUS_RXERRCH_CHA4  (0x00000004U)
#define EMAC_MACSTATUS_RXERRCH_CHA5  (0x00000005U)
#define EMAC_MACSTATUS_RXERRCH_CHA6  (0x00000006U)
#define EMAC_MACSTATUS_RXERRCH_CHA7  (0x00000007U)




#define EMAC_MACSTATUS_RXQOSACT (0x00000004U)
#define EMAC_MACSTATUS_RXQOSACT_SHIFT (0x00000002U)
#define EMAC_MACSTATUS_RXFLOWACT (0x00000002U)
#define EMAC_MACSTATUS_RXFLOWACT_SHIFT (0x00000001U)
#define EMAC_MACSTATUS_TXFLOWACT (0x00000001U)
#define EMAC_MACSTATUS_TXFLOWACT_SHIFT (0x00000000U)

/* EMCONTROL */


#define EMAC_EMCONTROL_SOFT     (0x00000002U)
#define EMAC_EMCONTROL_SOFT_SHIFT    (0x00000001U)

