RT-Thread/rt-thread/bsp/rm48x50/HALCoGen/include/hw_emac.h
#define EMAC_NETOCTETS_COUNT    (0xFFFFFFFFU)
#define EMAC_NETOCTETS_COUNT_SHIFT   (0x00000000U)


/* RXSOFOVERRUNS */

#define EMAC_RXSOFOVERRUNS_COUNT (0xFFFFFFFFU)
#define EMAC_RXSOFOVERRUNS_COUNT_SHIFT (0x00000000U)


/* RXMOFOVERRUNS */

#define EMAC_RXMOFOVERRUNS_COUNT (0xFFFFFFFFU)
#define EMAC_RXMOFOVERRUNS_COUNT_SHIFT (0x00000000U)


/* RXDMAOVERRUNS */

#define EMAC_RXDMAOVERRUNS_COUNT (0xFFFFFFFFU)
#define EMAC_RXDMAOVERRUNS_COUNT_SHIFT (0x00000000U)


/* MACADDRLO */


#define EMAC_MACADDRLO_VALID    (0x00100000U)
#define EMAC_MACADDRLO_VALID_SHIFT   (0x00000014U)
#define EMAC_MACADDRLO_MATCHFILT (0x00080000U)
#define EMAC_MACADDRLO_MATCHFILT_SHIFT (0x00000013U)
#define EMAC_MACADDRLO_CHANNEL  (0x00070000U)
#define EMAC_MACADDRLO_CHANNEL_SHIFT (0x00000010U)
#define EMAC_MACADDRLO_MACADDR0 (0x0000FF00U)
#define EMAC_MACADDRLO_MACADDR0_SHIFT (0x00000008U)
#define EMAC_MACADDRLO_MACADDR1 (0x000000FFU)
#define EMAC_MACADDRLO_MACADDR1_SHIFT (0x00000000U)


/* MACADDRHI */

#define EMAC_MACADDRHI_MACADDR2 (0xFF000000U)
#define EMAC_MACADDRHI_MACADDR2_SHIFT (0x00000018U)

#define EMAC_MACADDRHI_MACADDR3 (0x00FF0000U)
#define EMAC_MACADDRHI_MACADDR3_SHIFT (0x00000010U)

#define EMAC_MACADDRHI_MACADDR4 (0x0000FF00U)
#define EMAC_MACADDRHI_MACADDR4_SHIFT (0x00000008U)

#define EMAC_MACADDRHI_MACADDR5 (0x000000FFU)
#define EMAC_MACADDRHI_MACADDR5_SHIFT (0x00000000U)


/* MACINDEX */


#define EMAC_MACINDEX_MACINDEX  (0x0000001FU)
#define EMAC_MACINDEX_MACINDEX_SHIFT (0x00000000U)


/* TX0HDP */

#define EMAC_TX0HDP_TX0HDP      (0xFFFFFFFFU)
#define EMAC_TX0HDP_TX0HDP_SHIFT     (0x00000000U)


/* TX1HDP */

#define EMAC_TX1HDP_TX1HDP      (0xFFFFFFFFU)
#define EMAC_TX1HDP_TX1HDP_SHIFT     (0x00000000U)


/* TX2HDP */

#define EMAC_TX2HDP_TX2HDP      (0xFFFFFFFFU)
#define EMAC_TX2HDP_TX2HDP_SHIFT     (0x00000000U)


/* TX3HDP */

#define EMAC_TX3HDP_TX3HDP      (0xFFFFFFFFU)
#define EMAC_TX3HDP_TX3HDP_SHIFT     (0x00000000U)


/* TX4HDP */

#define EMAC_TX4HDP_TX4HDP      (0xFFFFFFFFU)
#define EMAC_TX4HDP_TX4HDP_SHIFT     (0x00000000U)


/* TX5HDP */

#define EMAC_TX5HDP_TX5HDP      (0xFFFFFFFFU)
#define EMAC_TX5HDP_TX5HDP_SHIFT     (0x00000000U)


/* TX6HDP */

#define EMAC_TX6HDP_TX6HDP      (0xFFFFFFFFU)
#define EMAC_TX6HDP_TX6HDP_SHIFT     (0x00000000U)


/* TX7HDP */

#define EMAC_TX7HDP_TX7HDP      (0xFFFFFFFFU)
#define EMAC_TX7HDP_TX7HDP_SHIFT     (0x00000000U)


/* RX0HDP */

#define EMAC_RX0HDP_RX0HDP      (0xFFFFFFFFU)
#define EMAC_RX0HDP_RX0HDP_SHIFT     (0x00000000U)


/* RX1HDP */

#define EMAC_RX1HDP_RX1HDP      (0xFFFFFFFFU)
#define EMAC_RX1HDP_RX1HDP_SHIFT     (0x00000000U)


/* RX2HDP */

#define EMAC_RX2HDP_RX2HDP      (0xFFFFFFFFU)
#define EMAC_RX2HDP_RX2HDP_SHIFT     (0x00000000U)


/* RX3HDP */

#define EMAC_RX3HDP_RX3HDP      (0xFFFFFFFFU)
#define EMAC_RX3HDP_RX3HDP_SHIFT     (0x00000000U)


/* RX4HDP */

#define EMAC_RX4HDP_RX4HDP      (0xFFFFFFFFU)
#define EMAC_RX4HDP_RX4HDP_SHIFT     (0x00000000U)


/* RX5HDP */

#define EMAC_RX5HDP_RX5HDP      (0xFFFFFFFFU)
#define EMAC_RX5HDP_RX5HDP_SHIFT     (0x00000000U)


/* RX6HDP */

#define EMAC_RX6HDP_RX6HDP      (0xFFFFFFFFU)
#define EMAC_RX6HDP_RX6HDP_SHIFT     (0x00000000U)


/* RX7HDP */

#define EMAC_RX7HDP_RX7HDP      (0xFFFFFFFFU)
#define EMAC_RX7HDP_RX7HDP_SHIFT     (0x00000000U)


/* TX0CP */

#define EMAC_TX0CP_TX0CP        (0xFFFFFFFFU)
#define EMAC_TX0CP_TX0CP_SHIFT       (0x00000000U)


/* TX1CP */

#define EMAC_TX1CP_TX1CP        (0xFFFFFFFFU)
#define EMAC_TX1CP_TX1CP_SHIFT       (0x00000000U)


/* TX2CP */

#define EMAC_TX2CP_TX2CP        (0xFFFFFFFFU)
#define EMAC_TX2CP_TX2CP_SHIFT       (0x00000000U)


/* TX3CP */

#define EMAC_TX3CP_TX3CP        (0xFFFFFFFFU)
#define EMAC_TX3CP_TX3CP_SHIFT       (0x00000000U)


/* TX4CP */

#define EMAC_TX4CP_TX4CP        (0xFFFFFFFFU)
#define EMAC_TX4CP_TX4CP_SHIFT       (0x00000000U)


/* TX5CP */

#define EMAC_TX5CP_TX5CP        (0xFFFFFFFFU)
#define EMAC_TX5CP_TX5CP_SHIFT       (0x00000000U)


/* TX6CP */

#define EMAC_TX6CP_TX6CP        (0xFFFFFFFFU)
#define EMAC_TX6CP_TX6CP_SHIFT       (0x00000000U)


/* TX7CP */

#define EMAC_TX7CP_TX7CP        (0xFFFFFFFFU)
#define EMAC_TX7CP_TX7CP_SHIFT       (0x00000000U)


/* RX0CP */

#define EMAC_RX0CP_RX0CP        (0xFFFFFFFFU)
#define EMAC_RX0CP_RX0CP_SHIFT       (0x00000000U)


/* RX1CP */

#define EMAC_RX1CP_RX1CP        (0xFFFFFFFFU)
#define EMAC_RX1CP_RX1CP_SHIFT       (0x00000000U)


/* RX2CP */

#define EMAC_RX2CP_RX2CP        (0xFFFFFFFFU)
#define EMAC_RX2CP_RX2CP_SHIFT       (0x00000000U)


/* RX3CP */

#define EMAC_RX3CP_RX3CP        (0xFFFFFFFFU)
#define EMAC_RX3CP_RX3CP_SHIFT       (0x00000000U)


/* RX4CP */

#define EMAC_RX4CP_RX4CP        (0xFFFFFFFFU)
#define EMAC_RX4CP_RX4CP_SHIFT       (0x00000000U)


/* RX5CP */

#define EMAC_RX5CP_RX5CP        (0xFFFFFFFFU)
#define EMAC_RX5CP_RX5CP_SHIFT       (0x00000000U)


/* RX6CP */

#define EMAC_RX6CP_RX6CP        (0xFFFFFFFFU)
#define EMAC_RX6CP_RX6CP_SHIFT       (0x00000000U)


/* RX7CP */

#define EMAC_RX7CP_RX7CP        (0xFFFFFFFFU)
#define EMAC_RX7CP_RX7CP_SHIFT       (0x00000000U)


#endif
